Database : berlintest
Restore  : NO

Operator : cdelete
Number   : 1
Signature: (text) -> bool
Example  : query cdelete('plz') 
Result   : TRUE

Operator : cspread
Number   : 1
Signature: ((stream (tuple x) x text x attr [x text [x text]])) -> int
Example  : query plz feed cspread['plz', PLZ, 'node1', 'QUORUM']
Result   : 41267

Operator : ccollect
Number   : 1
Signature: text [x text] -> stream(tuple(...))
Example  : query ccollect('plz', 'ONE') count
Result   : 41267

Operator : ccollectlocal
Number   : 1
Signature: text [x text] -> stream(tuple(...))
Example  : query ccollectlocal('plz', 'ONE') count
Result   : 41267

Operator : ccollectrange
Number   : 1
Signature: text x text x text [x text] -> stream(tuple(...))
Example  : query ccollectrange('plz', '1234', '5678', 'ONE') count
Result   : 41267

Operator : ccollectquery
Number   : 1
Signature: text x int [x text] -> stream(tuple(...))
Example  : query ccollectquery('plz', 2, 'ONE') count
Result   : 41267

Operator : clist
Number   : 1
Signature: () -> stream(text)
Example  : query clist() count
Result   : 10

Operator : cquerylist
Number   : 1
Signature: () -> stream(tuple())
Example  : query cquerylist() consume
Result   : 10

Operator : cqueryreset
Number   : 1
Signature: text x text -> bool
Example  : query cqueryreset()
Result   : TRUE

Operator : cqueryexecute
Number   : 1
Signature: int x text -> bool
Example  : query cqueryexecute(2, <text>query ccollectrange('relation2', __TOKEN__, 'ONE') count;</text--->)
Result   : TRUE

Operator : cquerywait
Number   : 1
Signature: int -> bool
Example  : query cqueryexecute(2)
Result   : TRUE

