Database : berlintest
Restore  : NO


Operator : no_components
Number   : 1
Signature: pointseq -> int
Example  : query no_components([const pointseq value ((0.0 0.0) (1.0 1.0))])
Result   : 2

Operator : no_components
Number   : 2
Signature: tpointseq -> int
Example  : query no_components([const tpointseq value (("2015-12-28" (0.0 0.0)) ("2015-12-29" (1.0 1.0)))])
Result   : 2


Operator : isempty
Number   : 1
Signature: pointseq -> bool
Example  : query isempty([const pointseq value ((0.0 0.0) (1.0 1.0))])
Result   : FALSE

Operator : isempty
Number   : 2
Signature: tpointseq -> bool
Example  : query isempty([const tpointseq value (("2015-12-28" (0.0 0.0)) ("2015-12-29" (1.0 1.0)))])
Result   : FALSE


Operator : to_dline
Number   : 1
Signature: pointseq -> dline
Example  : query to_dline([const pointseq value ((0.0 0.0) (1.0 1.0))])
Result   : (dline ((0.0 0.0 1.0 1.0)))

Operator : to_dline
Number   : 2
Signature: tpointseq -> dline
Example  : query to_dline([const tpointseq value (("2015-12-28" (0.0 0.0)) ("2015-12-29" (1.0 1.0)))])
Result   : (dline ((0.0 0.0 1.0 1.0)))


Operator : to_pointseq
Number   : 1
Signature: mpoint -> pointseq
Example  : query to_pointseq([const mpoint value ((("2015-12-29-01:23:45" "2015-12-29-01:30:20" TRUE FALSE) (1.0 2.3 -2.0 0.0)))])
Result   : (pointseq ((1.0 2.3) (-2.0 0.0)))

Operator : to_pointseq
Number   : 2
Signature: mpoint x bool -> pointseq
Example  : query to_pointseq([const mpoint value ((("2015-12-29-01:23:45" "2015-12-29-01:30:20" TRUE FALSE) (1.0 2.3 -2.0 0.0)))], TRUE)
Result   : (pointseq ((1.0 2.3) (-2.0 0.0)))

Operator : to_pointseq
Number   : 3
Signature: tpointseq -> pointseq
Example  : query to_pointseq([const tpointseq value (("2015-12-28" (0.0 0.0)) ("2015-12-29" (1.0 1.0)))])
Result   : (pointseq ((0.0 0.0) (1.0 1.0)))


Operator : to_tpointseq
Number   : 1
Signature: mpoint -> tpointseq
Example  : query to_tpointseq([const mpoint value ((("2015-12-29-01:23:45" "2015-12-29-01:30:20" TRUE FALSE) (1.0 2.3 -2.0 0.0)))])
Result   : (tpointseq (("2015-12-29-01:23:45" (1.0 2.3)) ("2015-12-29-01:30:20" (-2.0 0.0))))

Operator : to_tpointseq
Number   : 2
Signature: mpoint x bool -> tpointseq
Example  : query to_tpointseq([const mpoint value ((("2015-12-29-01:23:45" "2015-12-29-01:30:20" TRUE FALSE) (1.0 2.3 -2.0 0.0)))], TRUE)
Result   : (tpointseq (("2015-12-29-01:23:45" (1.0 2.3)) ("2015-12-29-01:30:20" (-2.0 0.0))))


Operator : sample_to_tpointseq
Number   : 1
Signature: tpointseq x duration [x bool [x bool]] -> tpointseq
Example  : query sample_to_tpointseq([const tpointseq value (("2015-12-29-01:23:45" (0.0 0.0)) ("2015-12-29-01:23:48" (3.0 1.5)))], [const duration value (0 1000)])
Result   : (tpointseq (("2015-12-29-01:23:45" (0.0 0.0)) ("2015-12-29-01:23:46" (1.0 0.5)) ("2015-12-29-01:23:47" (2.0 1.0)) ("2015-12-29-01:23:48" (3.0 1.5))))


Operator : sample_to_pointseq
Number   : 1
Signature: tpointseq x duration [x bool [x bool]] -> pointseq
Example  : query sample_to_pointseq([const tpointseq value (("2015-12-29-01:23:45" (0.0 0.0)) ("2015-12-29-01:23:48" (3.0 1.5)))], [const duration value (0 1000)])
Result   : (pointseq ((0.0 0.0) (1.0 0.5) (2.0 1.0) (3.0 1.5)))


Operator : dist_origin
Number   : 1
Signature: pointseq x pointseq -> real
Example  : query dist_origin([const pointseq value ((1.0 2.3) (-2.0 0.0))], [const pointseq value ((2.5 1.2) (0.5 3.2))])
Result   : (real 1.860107523773827)

Operator : dist_origin
Number   : 2
Signature: pointseq x pointseq x geoid -> real
Example  : query dist_origin([const pointseq value ((1.0 2.3) (-2.0 0.0))], [const pointseq value ((2.5 1.2) (0.5 3.2))], create_geoid("WGS1984"))
Result   : (real 206067.0862065959)


Operator : dist_destination
Number   : 1
Signature: pointseq x pointseq -> real
Example  : query dist_destination([const pointseq value ((1.0 2.3) (-2.0 0.0))], [const pointseq value ((2.5 1.2) (0.5 3.2))])
Result   : (real 4.060788100849391)

Operator : dist_destination
Number   : 2
Signature: pointseq x pointseq x geoid -> real
Example  : query dist_destination([const pointseq value ((1.0 2.3) (-2.0 0.0))], [const pointseq value ((2.5 1.2) (0.5 3.2))], create_geoid("WGS1984"))
Result   : (real 449506.9201455081)


Operator : dist_origin_and_destination
Number   : 1
Signature: pointseq x pointseq -> real
Example  : query dist_origin_and_destination([const pointseq value ((1.0 2.3) (-2.0 0.0))], [const pointseq value ((2.5 1.2) (0.5 3.2))])
Result   : (real 5.920895624623218)

Operator : dist_origin_and_destination
Number   : 2
Signature: pointseq x pointseq x geoid -> real
Example  : query dist_origin_and_destination([const pointseq value ((1.0 2.3) (-2.0 0.0))], [const pointseq value ((2.5 1.2) (0.5 3.2))], create_geoid("WGS1984"))
Result   : (real 655574.006352104)


Operator : dist_euclidean
Number   : 1
Signature: pointseq x pointseq -> real
Example  : query dist_euclidean([const pointseq value ((1.0 2.3) (-2.0 0.0))], [const pointseq value ((2.5 1.2) (0.5 3.2))])
Result   : (real 4.466542286825459)

Operator : dist_euclidean
Number   : 2
Signature: pointseq x pointseq x geoid -> real
Example  : query dist_euclidean([const pointseq value ((1.0 2.3) (-2.0 0.0))], [const pointseq value ((2.5 1.2) (0.5 3.2))], create_geoid("WGS1984"))
Result   : (real 494489.7524482958)


Operator : lcss
Number   : 1
Signature: pointseq x pointseq x real -> int
Example  : query lcss([const pointseq value ((1.0 2.3) (-2.0 0.0))], [const pointseq value ((2.5 1.2) (0.5 3.2))], 1.5)
Result   : (int 1)

Operator : lcss
Number   : 2
Signature: pointseq x pointseq x real x int -> int
Example  : query lcss([const pointseq value ((1.0 2.3) (-2.0 0.0))], [const pointseq value ((2.5 1.2) (0.5 3.2))], 0.5, 0)
Result   : (int 0)

Operator : lcss
Number   : 3
Signature: mlabel x mlabel -> int
Example  : query lcss([const mlabel value ((("2015-12-29-01:23:45" "2015-12-29-01:30:20" TRUE FALSE) 'Label_A') (("2015-12-29-01:30:20" "2015-12-29-01:33:05" TRUE FALSE) 'Label_B'))], [const mlabel value ((("2015-12-29-01:23:45" "2015-12-29-01:30:20" TRUE FALSE) 'Label_B') (("2015-12-29-01:30:20" "2015-12-29-01:33:05" TRUE FALSE) 'Label_C'))])
Result   : (int 1)

Operator : lcss
Number   : 4
Signature: mlabel x mlabel x int -> int
Example  : query lcss([const mlabel value ((("2015-12-29-01:23:45" "2015-12-29-01:30:20" TRUE FALSE) 'Label_A') (("2015-12-29-01:30:20" "2015-12-29-01:33:05" TRUE FALSE) 'Label_B'))], [const mlabel value ((("2015-12-29-01:23:45" "2015-12-29-01:30:20" TRUE FALSE) 'Label_B') (("2015-12-29-01:30:20" "2015-12-29-01:33:05" TRUE FALSE) 'Label_C'))], 0)
Result   : (int 0)


Operator : rel_lcss
Number   : 1
Signature: pointseq x pointseq x real -> real
Example  : query rel_lcss([const pointseq value ((1.0 2.3) (-2.0 0.0))], [const pointseq value ((2.5 1.2) (0.5 3.2))], 1.5)
Result   : (real 0.5)

Operator : rel_lcss
Number   : 2
Signature: pointseq x pointseq x real x int -> real
Example  : query rel_lcss([const pointseq value ((1.0 2.3) (-2.0 0.0))], [const pointseq value ((2.5 1.2) (0.5 3.2))], 0.5, 0)
Result   : (real 0.0)

Operator : rel_lcss
Number   : 3
Signature: mlabel x mlabel -> int
Example  : query rel_lcss([const mlabel value ((("2015-12-29-01:23:45" "2015-12-29-01:30:20" TRUE FALSE) 'Label_A') (("2015-12-29-01:30:20" "2015-12-29-01:33:05" TRUE FALSE) 'Label_B'))], [const mlabel value ((("2015-12-29-01:23:45" "2015-12-29-01:30:20" TRUE FALSE) 'Label_B') (("2015-12-29-01:30:20" "2015-12-29-01:33:05" TRUE FALSE) 'Label_C'))])
Result   : (real 0.5)

Operator : rel_lcss
Number   : 4
Signature: mlabel x mlabel x int -> int
Example  : query rel_lcss([const mlabel value ((("2015-12-29-01:23:45" "2015-12-29-01:30:20" TRUE FALSE) 'Label_A') (("2015-12-29-01:30:20" "2015-12-29-01:33:05" TRUE FALSE) 'Label_B'))], [const mlabel value ((("2015-12-29-01:23:45" "2015-12-29-01:30:20" TRUE FALSE) 'Label_B') (("2015-12-29-01:30:20" "2015-12-29-01:33:05" TRUE FALSE) 'Label_C'))], 0)
Result   : (real 0.0)


Operator : dist_lcss
Number   : 1
Signature: pointseq x pointseq x real -> real
Example  : query dist_lcss([const pointseq value ((1.0 2.3) (-2.0 0.0))], [const pointseq value ((2.5 1.2) (0.5 3.2))], 1.5)
Result   : (real 0.5)

Operator : dist_lcss
Number   : 2
Signature: pointseq x pointseq x real x int -> real
Example  : query dist_lcss([const pointseq value ((1.0 2.3) (-2.0 0.0))], [const pointseq value ((2.5 1.2) (0.5 3.2))], 0.5, 0)
Result   : (real 1.0)

Operator : dist_lcss
Number   : 3
Signature: mlabel x mlabel -> int
Example  : query dist_lcss([const mlabel value ((("2015-12-29-01:23:45" "2015-12-29-01:30:20" TRUE FALSE) 'Label_A') (("2015-12-29-01:30:20" "2015-12-29-01:33:05" TRUE FALSE) 'Label_B'))], [const mlabel value ((("2015-12-29-01:23:45" "2015-12-29-01:30:20" TRUE FALSE) 'Label_B') (("2015-12-29-01:30:20" "2015-12-29-01:33:05" TRUE FALSE) 'Label_C'))])
Result   : (real 0.5)

Operator : dist_lcss
Number   : 4
Signature: mlabel x mlabel x int -> int
Example  : query dist_lcss([const mlabel value ((("2015-12-29-01:23:45" "2015-12-29-01:30:20" TRUE FALSE) 'Label_A') (("2015-12-29-01:30:20" "2015-12-29-01:33:05" TRUE FALSE) 'Label_B'))], [const mlabel value ((("2015-12-29-01:23:45" "2015-12-29-01:30:20" TRUE FALSE) 'Label_B') (("2015-12-29-01:30:20" "2015-12-29-01:33:05" TRUE FALSE) 'Label_C'))], 0)
Result   : (real 1.0)


Operator : dist_lip
Number   : 1
Signature: pointseq x pointseq -> real
Example  : query dist_lip([const pointseq value ((0.0 0.0) (1.0 0.0))], [const pointseq value ((0.0 1.0) (1.0 0.5))])
Result   : (real 0.75)


Operator : dist_stlip
Number   : 1
Signature: tpointseq x tpointseq x real x duration -> real
Example  : query dist_stlip([const tpointseq value (("2015-12-29-01:23:45" (0.0 0.0)) ("2015-12-29-01:30:20" (1.0 0.0)))], [const tpointseq value (("2015-12-29-01:23:45" (0.0 1.0)) ("2015-12-29-01:30:20" (1.0 0.5)))], [const real value 1.0], [const duration value (0 0)])
Result   : (real 0.75)


Operator : dist_spstlip2
Number   : 1
Signature: tpointseq x tpointseq x real x duration -> real
Example  : query dist_spstlip2([const tpointseq value (("2015-12-29-01:23:45" (0.0 0.0)) ("2015-12-29-01:30:20" (1.0 0.0)))], [const tpointseq value (("2015-12-29-01:23:45" (0.0 1.0)) ("2015-12-29-01:30:20" (1.0 0.5)))], [const real value 1.0], [const duration value (0 0)], [const real value 1.0])
Result   : (real 0.7917960675006309)


Operator : genlip
Number   : 1
Signature: pointseq x pointseq x int x (pointseq x pointseq -> real) -> real
Example  : query genlip([const pointseq value ((0.0 0.0) (0.2 0.0) (1.0 0.0))], [const pointseq value ((0.0 1.0) (1.0 0.5))], [const int value 3], fun(seq1 : pointseq, seq2 : pointseq) dist_lip(seq1, seq2))
Result   : (real 0.55)

Operator : genlip
Number   : 2
Signature: tpointseq x tpointseq x int x (tpointseq x tpointseq -> real) -> real
Example  : query genlip([const tpointseq value (("2015-12-29-01:20:00" (0.0 0.0)) ("2015-12-29-01:30:00" (1.0 0.0)))], [const tpointseq value (("2015-12-29-01:20:00" (0.0 1.0)) ("2015-12-29-01:30:00" (1.0 1.0)))], [const int value 3], fun(seq1 : tpointseq, seq2 : tpointseq) dist_spstlip2(seq1, seq2, [const real value 0.0], [const duration value (0 0)], [const real value 1.0]))
Result   : (real 1.0)


Operator : genlip2
Number   : 1
Signature: pointseq x pointseq x int x (pointseq x pointseq -> real) -> real
Example  : query genlip2([const pointseq value ((0.0 0.0) (0.2 0.0) (1.0 0.0))], [const pointseq value ((0.0 1.0) (1.0 0.5))], [const int value 3], fun(seq1 : pointseq, seq2 : pointseq) dist_lip(seq1, seq2))
Result   : (real 0.75)

Operator : genlip2
Number   : 2
Signature: tpointseq x tpointseq x int x (tpointseq x tpointseq -> real) -> real
Example  : query genlip2([const tpointseq value (("2015-12-29-01:20:00" (0.0 0.0)) ("2015-12-29-01:30:00" (1.0 0.0)))], [const tpointseq value (("2015-12-29-01:20:00" (0.0 1.0)) ("2015-12-29-01:30:00" (1.0 1.0)))], [const int value 3], fun(seq1 : tpointseq, seq2 : tpointseq) dist_spstlip2(seq1, seq2, [const real value 0.0], [const duration value (0 0)], [const real value 1.0]))
Result   : (real 1.0)
